start_text = """Это Мафия-Бот🕵🏻
        \n🕹️| Коротко о игре:\n«🔪🩸» — это командная психологическая игра, в которой участники играют за мирных жителей или за мафию. \nЦель игры — вычислить и «уничтожить» всех членов противоположной команды. \nПобеждает команда, которая первая достигнет своих целей.
        \n▫️Как начать игру?
        1️⃣ Добавьте бота в групповой чат и дайте права администратора\n
        2️⃣ Запустите игру командой /start_game.\n
        3️⃣ Чтобы присоединиться к игре, используйте команду /join.\n
        4️⃣ Игрок, запустивший игру, должен ввести команду /begin для начала игры."""


help_text = """🔧| Функционал:\n
    ▫️Создание новой игры 🎮: Используйте команду /start_game в групповом чате, чтобы начать новую игру.\n
    ▫️Присоединение к игре 🔗: После запуска игры участники могут присоединиться, используя команду /join.\n
    ▫️Начало игры 🚩: Игрок, который создал игру, может начать ее командой /begin.\n
    ▫️Ночные действия 🌃🔪: В ночные фазы игры бот отправляет игрокам персональные сообщения с инструкциями для выполнения действий.\n
    ▫️Голосование 📢: В дневные фазы игры бот позволяет игрокам голосовать за подозреваемого игрока.\n
    ▫️Определение победителя 🏆: Бот объявляет победителя игры после того, как одна из команд (🔪🩸 или 🙎‍♂️) выигрывает."""


rules_text = """📜| Правила игры:
    ▫️В начале игры каждому участнику случайным образом присваивается 🎭: 🙎‍♂️ или 🔪🩸.\n
    ▫️Присутствует 👨🏻‍⚕️, который может 💊 любого игрока.\n
    ▫️Также среди 🙎‍♂️ есть 🕵🏻, который знает роли других игроков, но не может раскрыть их другим участникам.\n
    ▫️Игра состоит из 🌃 и 🏙️. Во время 🌃 игроки тайно голосуют, используя команды "убийства" или "подозрения", чтобы решить, кого «☠️» или «🔎».\n
    ▫️Днём происходит 💭 и 📢, по итогам которого один из игроков выбывает. Побеждает команда, которая первая убьет всех 🙎‍♂️ или кикнут всех 🔪🩸.
    ▫️Во время 💭 каждый игрок может высказать свои подозрения относительно других участников, а также предложить кандидата на выбывание.\n
    ▫️Однако окончательное решение принимается путём 📢.\n
    ▫️После каждого выбывания 🎭 раскрываются, и игроки могут обсудить новую информацию о других участниках.\n
    ▫️Игра продолжается до тех пор, пока одна из команд не достигнет своей цели.
"""


